{
  "model_type": "transformer",
  "architecture": "llama",
  "num_hidden_layers": 24,
  "hidden_size": 1024,
  "intermediate_size": 4096,
  "num_attention_heads": 16,
  "vocab_size": 50257,
  "max_position_embeddings": 2048,
  "use_cache": true,
  "torch_dtype": "float16",
  "transformers_version": "4.36.0"
}
