{
  "auto_map": {
    "AutoTokenizer": [
      "LLaMATokenizer",
      null
    ]
  },
  "clean_up_tokenization_spaces": false,
  "model_max_length": 2048,
  "padding_side": "right",
  "truncation_side": "right",
  "use_fast": true,
  "tokenizer_class": "LLaMATokenizer"
}
